---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetProperty.IsReadOnly
source: html/6d5fa82f-4a78-1928-b267-c33b92b6d6ea.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.IsReadOnly Property

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.

## Syntax (C#)
```csharp
public bool IsReadOnly { get; }
```